app/controllers/clientes_controller.rb

  def show
    @cliente = Cliente.find(params[:id])
---
SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @cliente = Cliente.new(cliente_params)

    if @cliente.save
---
INSERT INTO "clientes" ("nombre", "correo", "contraseña", "direccion", "telefono", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @cliente = Cliente.find(params[:id])
    @cliente.destroy
---
SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "clientes" WHERE "clientes"."id" = $1  [["id", 1]]