app/controllers/productos_controller.rb

  def index
    @productos = Producto.all
---
SELECT "productos".* FROM "productos"

  def show
    @producto = Producto.find(params[:id])
---
SELECT "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @producto = Producto.new(producto_params)

    if @producto.save
---
INSERT INTO "productos" ("nombre", "precio", "descripcion", "promocion", "tipo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def edit
    @producto = Producto.find(params[:id])
---
SELECT "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def update
    @producto = Producto.find(params[:id])

    if @producto.update(producto_params)
---
SELECT "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "productos" SET "descripcion" = $1, "updated_at" = $2 WHERE "productos"."id" = $3  [["descripcion", "Filete de pescado empanizado, lechuga, tomate, salsa tártara."], ["updated_at", "2024-03-17 17:49:57.626079"], ["id", 8]]

  def destroy
    @producto = Producto.find(params[:id])
    @producto.destroy
---
SELECT "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "productos" WHERE "productos"."id" = $1  [["id", 1]]