app/controllers/tiendas_controller.rb

  def index
    @tiendas = Tienda.all
---
SELECT "tiendas".* FROM "tiendas"

  def show
    @tienda = Tienda.find(params[:id])
---
SELECT "tiendas".* FROM "tiendas" WHERE "tiendas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @tienda = Tienda.new(tienda_params)

    if @tienda.save
---
INSERT INTO "tiendas" ("nombre", "direccion", "telefono", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def edit
    @tienda = Tienda.find(params[:id])
---
SELECT "tiendas".* FROM "tiendas" WHERE "tiendas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]