app/controllers/usuarios_controller.rb

  def show
    @usuario = Usuario.find(params[:id])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @usuario = Usuario.new(usuario_params)

    if @usuario.save
---
INSERT INTO "usuarios" ("nombre", "correo", "contraseña", "roll", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def edit
    @usuario = Usuario.find(params[:id])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    @usuario = Usuario.find(params[:id])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def destroy
    @usuario = Usuario.find(params[:id])
    @usuario.destroy
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "usuarios" WHERE "usuarios"."id" = $1  [["id", 2]]